package hangman;

/**
 * Να αναπτύξετε μια γραφική διεπαφή για το παιχνίδι Κρεμάλα. Η λογική του παιχνιδιού να αναπτυχθεί ξεχωριστά από
 * το γραφικό περιβάλλον. Ο χρήστης θα πρέπει να έχει την δυνατότητα να δημιουργεί νέο παιχνίδι όπου θα ορίζει
 * την μυστική λέξη. Έπειτα, θα εμφανίζεται η λέξη με _ ανάλογα με το μέγθος της. Θα δίνεται η δυνατότητα στο χρήστη να
 * εισάγει το χαρακτήρα τον οποίο θέλει. Αν ο χαρακτήρας υπάρχει στην λέξη αυτός θα αντικαθιστά την _.
 * Σε αντίθετη περίτπωση θα αυξάνεται το σχέδιο της κρεμάλας όπως στο κλασικό παιχνίδι. Σε κάθε περίτπωση θα εμφανίζονται
 * όλοι οι χαρακτήρες όπου δοκίμασε ο χρήστης.
 */
public class HangmanApp {
    public static void main(String[] args) {
        HangmanGUI1 hangman = new HangmanGUI1();
        hangman.start();
    }
}
